verification/openfoam/fissileSolutionTank/openfoam/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
application         buoyantBoussinesqPimpleFoam;
startFrom           startTime;
startTime           0;
stopAt              endTime;
endTime             120;
deltaT              0.1;
writeControl        timeStep;
writeInterval       1200;
purgeWrite          2;
writeFormat         ascii;
writePrecision      12;
runTimeModifiable   true;

functions
{
    wallYPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeFields     yes;
        executeControl  writeTime;
        writeControl    writeTime;
    }
}
