verification/openfoam/fissileSolutionTank/openfoam/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

mergeType points;
scale 1;

vertices
(
    (0 0 0)
    (0 0 0.3)
    (0.0999048221581858 -0.0043619387365336 0)
    (0.0999048221581858 -0.0043619387365336 0.3)
    (0.0999048221581858  0.0043619387365336 0)
    (0.0999048221581858  0.0043619387365336 0.3)
);

blocks
(
    hex (2 0 1 3 4 0 1 5) (50 150 1)
    simpleGrading
    (
        (
            (0.0715420976 0.1 1.93877776)
            (0.9284579024 0.9 1)
        )
        (
            (0.0238473658666667 0.0333333333333333 1.93877776)
            (0.952305268266667  0.933333333333333  1)
            (0.0238473658666667 0.0333333333333333 0.515788875151941)
        )
        1
    )
);

edges
(
);

boundary
(
    sideWall
    {
        type wall;
        faces ((2 4 5 3));
    }
    bottomWall
    {
        type wall;
        faces ((2 0 0 4));
    }
    topWall
    {
        type wall;
        faces ((3 5 1 1));
    }
    wedgeFront
    {
        type wedge;
        faces ((2 3 1 0));
    }
    wedgeBack
    {
        type wedge;
        faces ((4 0 1 5));
    }
);

mergePatchPairs
(
);
