verification/openfoam/fissileSolutionTank/openfoam/constant/transportProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1e-6;
beta            [0 0 0 -1 0 0 0] 2.1e-4;
TRef            [0 0 0 1 0 0 0] 300;
Pr              [0 0 0 0 0 0 0] 7;
Prt             [0 0 0 0 0 0 0] 0.85;
