verification/openfoam/fissileSolutionTank/openfoam/0/p_rgh
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    sideWall   { type fixedFluxPressure; value uniform 0; }
    bottomWall { type fixedFluxPressure; value uniform 0; }
    topWall    { type fixedFluxPressure; value uniform 0; }
    wedgeFront { type wedge; }
    wedgeBack  { type wedge; }
}
