verification/openfoam/fissileSolutionTank/openfoam/0/k
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-6;
boundaryField
{
    sideWall
    {
        type    kqRWallFunction;
        value   uniform 1e-6;
    }
    bottomWall
    {
        type    kqRWallFunction;
        value   uniform 1e-6;
    }
    topWall
    {
        type    kqRWallFunction;
        value   uniform 1e-6;
    }
    wedgeFront { type wedge; }
    wedgeBack  { type wedge; }
}
