verification/openfoam/fissileSolutionTank/openfoam/0/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 1e-6;
boundaryField
{
    sideWall
    {
        type    nutkWallFunction;
        value   uniform 0;
    }
    bottomWall
    {
        type    nutkWallFunction;
        value   uniform 0;
    }
    topWall
    {
        type    nutkWallFunction;
        value   uniform 0;
    }
    wedgeFront { type wedge; }
    wedgeBack  { type wedge; }
}
